#include "ws2812.h"

//-------------------------------------------------------------------------------
//发送一个像素给WS2812 一个像素3色*8位数据	@11.0592MHz 非固定可以略偏
//-------------------------------------------------------------------------------
// void SendOnePix(unsigned char *ptr)
//{
//	unsigned char i,j;
//	unsigned char temp;
//
//	//原本是3，改成一个像素发两次就是6...
//	for(j=0;j<3;j++)
//	{
//		temp=ptr[j];
//		for(i=0;i<8;i++)
//		{
//			if(temp&0x80)		 //从高位开始发送
//			{
//				DI=1;			 //发送“1”码
//				_nop_();		 //不可省略的nop(),延时指定时间作用，晶振频率33MHz
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();

//				DI=0;
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
//			}
//			else				//发送“0”码
//			{
//				DI=1;
//				_nop_();
//				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();

//				DI=0;
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
////				_nop_();
//			}
//			temp=(temp<<1);		 //左移位
//		}
//	}
//}

//-------------------------------------------------------------------------------
//发送一个像素给WS2812 一个像素3色*8位数据	@22.1184MHz 非固定可以略偏
//-------------------------------------------------------------------------------
void SendOnePix(uchar *ptr)
{
	uchar i, j, temp;

	//原本是3，改成一个像素发两次就是6...
	for (j = 0; j < 3; j++)
	{
		temp = ptr[j];
		for (i = 0; i < 8; i++)
		{
			if (temp & 0x80) //从高位开始发送
			{
				DI = 1;	 //发送“1”码
				_nop_(); //不可省略的nop(),延时指定时间作用，晶振频率33MHz
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();

				DI = 0;
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
			}
			else //发送“0”码
			{
				DI = 1;
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
//				_nop_();
//				_nop_();

				DI = 0;
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
			}
			temp = (temp << 1); //左移位
		}
	}
}

//-------------------------------------------------------------------------------
//发送一个像素给WS2812 一个像素3色*8位数据	@33.0MHz 不固定可以略偏 nop可以删减修改频率
//-------------------------------------------------------------------------------
// void SendOnePix(unsigned char *ptr)
//{
//	unsigned char i,j;
//	unsigned char temp;
//	//原本是3，改成一个像素发两次就是6...
//	for(j=0;j<3;j++)
//	{
//		temp=ptr[j];
//		for(i=0;i<8;i++)
//		{
//			if(temp&0x80)		 //从高位开始发送
//			{
//				DI=1;			 //发送“1”码
//				_nop_();		 //不可省略的nop(),延时指定时间作用，晶振频率33MHz
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();

//				DI=0;
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//			}
//			else				//发送“0”码
//			{
//				DI=1;
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();

//				DI=0;
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//				_nop_();
//			}
//			temp=(temp<<1);		 //左移位
//		}
//	}
//}

//-------------------------------------------------------------------------------
//发送一帧数据给WS2812 n表示从第n个灯开始发送，+n表示顺时针，-n逆时针
//-------------------------------------------------------------------------------
void SendOneFrame(char n, uchar *ptr)
{
	uchar k;
	if (0 <= n)
	{
		for (k = (SNUM - n); k < SNUM; k++) //发送一帧数据
		{
			SendOnePix(&ptr[(3 * k)]);
		}
		for (k = 0; k < (SNUM - n); k++)
		{
			SendOnePix(&ptr[(3 * k)]);
		}
	}
	else
	{
		n = n * -1;
		for (k = n; k < SNUM; k++) //发送一帧数据
		{
			SendOnePix(&ptr[(3 * k)]);
		}
		for (k = 0; k < n; k++)
		{
			SendOnePix(&ptr[(3 * k)]);
		}
	}
}
